[
    {
        "company": "Pro Athlete, Inc.",
        "description": "Sporting Goods E-commerce",
        "city": "Kansas City",
        "state": "MO",
        "phone": "+1 (816) 587-6050",
        "start": "06/21/2021",
        "end": "Current",
        "title": "Web Developer",
        "summary": "Plan accessibility, user experience, A/B and UI testing, design integration, and development of all legacy B2C e-commerce sites and several modern internal business applications.",
        "detail": "",
        "bullets": [
            "Planned and executed accessibility and user experience strategies for B2C e-commerce sites.",
            "Conducted A/B and UI testing to enhance user engagement and site performance.",
            "Integrated modern design principles into legacy applications, improving overall functionality.",
            "Developed several internal business solutions to streamline operations at Pro Athlete."
        ],
        "skills": [
            ".NET MVC",
            "Vue",
            "Vite",
            "Alpine",
            "JavaScript ES6",
            "Tailwind",
            "jQuery",
            "Selenium",
            "NUnit",
            "AWS",
            "GTM",
            "SQL",
            "Figma",
            "Clarity",
            "HubSpot"
        ],
        "relevant": true
    },
    {
        "company": "Diamond Merckens Hogan",
        "description": "Marketing Agency",
        "city": "Kansas City",
        "state": "MO",
        "phone": "+1 (816) 471-4364",
        "start": "07/31/2019",
        "end": "06/21/2021",
        "title": "Senior Developer",
        "summary": "Develop and ensure static, CMS, and e-commerce sites were in fully functional, user friendly, and accessible. Created and managed any and all AEM projects. Full-stack developer for all projects - whether AEM, Wagtail, Wordpress, or otherwise.",
        "detail": "Front- and back-end web development. Met with clients, creative teams, and dev/IT team to make sure static, CMS, and e-commerce sites were in fully functional, user friendly, and accessible. Leading development (AEM 6.4) in a larger AMS ecosystem. In charge of [Circle] CI, Apache server configs, OSGI configs, Java services, and ongoing component development (all UX/UI included).",
        "bullets": [
            "Developed and maintained static, CMS, and e-commerce sites to ensure full functionality and user accessibility.",
            "Managed and optimized AEM, Wagtail, and WordPress sites for enhanced user experience.",
            "Collaborated with cross-functional teams to deliver user-friendly web solutions that meet client needs."
        ],
        "skills": [
            "Java",
            "JavaScript ES6",
            "Maven",
            "HTL / Sightly",
            "jQuery",
            "Python",
            "Django",
            "Wagtail",
            "PHP",
            "Wordpress"
        ],
        "relevant": true
    },
    {
        "company": "Artisan Technology Group",
        "now": "Viagio Technology",
        "description": "Software Consulting",
        "city": "Kansas City",
        "state": "MO",
        "phone": "+1 (816) 226-6217",
        "start": "05/06/2018",
        "end": "07/31/2019",
        "title": "User Experience Architect",
        "summary": "",
        "detail": "I worked closely with our partners and clients to improve messaging and strategic tactics throughout their brands and systems. Beginning with market research and in-depth business discovery I organized, planned, designed, prototyped, and developed custom interfaces and marketing materials for a wide variety of technology applications.",
        "bullets": [
            "Collaborated with partners and clients to enhance brand messaging and strategies.",
            "Conducted market research and in-depth business discovery to inform design decisions.",
            "Organized, planned, and developed custom interfaces and marketing materials tailored to client needs.",
            "Contributed to the growth of Artisan by delivering user-centric design solutions."
        ],
        "skills": [
            "XD",
            "AWS",
            "Node",
            "Angular",
            "React",
            ".NET"
        ],
        "relevant": true
    },
    {
        "company": "Intouch Solutions, Inc.",
        "now": "Eversana",
        "description": "Healthcare Marketing Agency",
        "city": "Overland Park",
        "state": "KS",
        "phone": "+1 (913) 317-3700",
        "start": "02/17/2014",
        "end": "05/06/2018",
        "title": "Principal Developer",
        "summary": "I worked closely with developers, architects and C-suite on complex and high-profile projects. I often acted as liaison with technology vendors and client IT groups. While my primary focus was always implementation and development, my team created SOPs, documented standards, and I mentored team developers. We created an enterprise-scale component library and style guide to be reused across brand properties.",
        "detail": "Work closely with architects and execs on complex or high-profile projects. Often acting as liaison with technology vendors and client IT groups while leading small teams of developers. Creation, implementation, and ongoing development of a reusable component library. Documentation and mentoring team developers on specific technologies to ensure the long-term growth of the business.",
        "bullets": [
            "Collaborated with developers, architects, and C-suite on high-profile projects, ensuring alignment on goals and deliverables.",
            "Acted as a liaison between technology vendors and client IT groups to facilitate seamless communication and project execution.",
            "Developed standard operating procedures and documented standards while mentoring team developers to enhance skill sets.",
            "Led the creation of an enterprise-scale component library and style guide for consistent branding across properties."
        ],
        "skills": [
            ".NET MVC",
            "Java",
            "Maven",
            "JavaScript ES6",
            "HTL / Sightly",
            "jQuery",
            "Angular"
        ],
        "relevant": true
    },
    {
        "company": "Softek Solutions, Inc.",
        "now": null,
        "description": "Healthcare Software",
        "city": "Prairie Village",
        "state": "KS",
        "phone": "+1 (913) 649-1024",
        "start": "08/30/2010",
        "end": "02/17/2014",
        "title": "Web Developer",
        "summary": "Design and development of the websites, social networking and general online presence of SSI. Rolled a custom PHP CMS for all web properties and an online education management application.",
        "detail": "Design and development of the websites, social networking and general online presence of SSI. Rolled a custom PHP CMS for all web properties and an online education management application.",
        "bullets": [
            "Designed and developed the web experience for softekinc.com, enhancing product visibility.",
            "Managed the online presence, including social networking platforms.",
            "Collaborated with team members to ensure a cohesive brand identity across digital channels."
        ],
        "skills": [
            "PHP",
            "PostgreSQL",
            "jQuery",
            "JavaScript ES6"
        ],
        "relevant": true
    },
    {
        "company": "Ultra International",
        "now": "Ultra Soap International",
        "description": "Manufacturer",
        "city": "Kansas City",
        "state": "MO",
        "phone": "+1 (800) 458-7627",
        "start": "07/27/2009",
        "end": "08/30/2010",
        "title": "Web Developer",
        "summary": "Design and development of the websites of UI and its subsidiaries. Included an admin area for MLM members and back office e-commerce.",
        "detail": "",
        "bullets": [
            "Maintained multiple websites for Ultra International, ensuring optimal performance and user experience.",
            "Developed innovative marketing strategies for the company and subsidiaries to enhance product visibility."
        ],
        "skills": [
            "PHP",
            "Photoshop",
            "Illustrator",
            "Actionscript"
        ],
        "relevant": true
    },
    {
        "company": "Fort Dodge Animal Health",
        "now": "Zoetis",
        "description": "Verterinary Pharmaceutical Manufacturing",
        "city": "Overland Park",
        "state": "KS",
        "phone": null,
        "start": "03/01/2008",
        "end": "07/27/2009",
        "title": "Creative Artist",
        "summary": "Designed marketing and sales support materials for Fort Dodge Animal Health and our parent company, Wyeth Pharmaceuticals - almost solely print production.",
        "detail": "",
        "bullets": [
            "Designed and produced a variety of marketing materials, including brochures and advertisements.",
            "Coordinated with vendors to ensure quality and timely delivery of projects.",
            "Collaborated with graphic designers and marketing teams to develop effective communication strategies.",
            "Maintained brand integrity by adhering to company identity standards."
        ],
        "skills": [
            "Photoshop",
            "Illustrator"
        ],
        "relevant": false
    },
    {
        "company": "Kansas City Star",
        "now": null,
        "description": "Regional News Service",
        "city": "Kansas City",
        "state": "MO",
        "phone": "+1 (816) 234-4907",
        "start": "10/01/2005",
        "end": "03/01/2008",
        "title": "Designer and Developer",
        "summary": "Began designing display ads for placement in the Kansas City Star. Then designed and developed banner ads, forms, widgets, websites, e-mail campaigns, etc. for KansasCity.com and interoffice McClatchy Interactive use.",
        "detail": "",
        "bullets": [],
        "skills": [
            "Photoshop",
            "Illustrator",
            "Actionscript"
        ],
        "relevant": false
    },
    {
        "company": "H & H Color Lab",
        "now": null,
        "description": "Photography Lab",
        "city": "Raytown",
        "state": "MO",
        "phone": "+1 (800) 821-1305",
        "start": "06/01/2005",
        "end": "10/01/2005",
        "title": "Digital Retouch Specialist",
        "summary": "Retouch professional photos in a production environment.",
        "detail": "Extensive training and labor in Adobe Photoshop retouching professional photographs.",
        "bullets": [],
        "skills": [
            "Photoshop"
        ],
        "relevant": false
    },
    {
        "company": "Graceland University Creative Media Center",
        "now": null,
        "description": "Marketing Department",
        "city": "Lamoni",
        "state": "IA",
        "phone": "+1 (641) 784-5000",
        "start": "05/31/2003",
        "end": "05/31/2005",
        "title": "Graphic Designer",
        "summary": "Part- and full-time in the Creative Media Center, designing mostly through the athletic department (programs, schedules, posters, etc.).",
        "detail": "",
        "bullets": [],
        "skills": [
            "Photoshop",
            "Illustrator"
        ],
        "relevant": false
    }
]